In [1]:
import numpy as np
import pandas as pd

In [4]:
d = {
    'A':[1, 2, 3, np.nan],
    'B':[10, np.nan, np.nan, np.nan],
    'C':[100, 200, 300, 400],
    'D':[np.nan, np.nan, np.nan, np.nan]
}

df = pd.DataFrame(d)

In [5]:
df

     A     B    C   D
0  1.0  10.0  100 NaN
1  2.0   NaN  200 NaN
2  3.0   NaN  300 NaN
3  NaN   NaN  400 NaN

In [6]:
df.isnull()

       A      B      C     D
0  False  False  False  True
1  False   True  False  True
2  False   True  False  True
3   True   True  False  True

In [7]:
df.isnull().sum()

A    1
B    3
C    0
D    4
dtype: int64

In [8]:
df.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [10]:
df.dropna(axis=1)

     C
0  100
1  200
2  300
3  400

In [11]:
df.dropna(axis=1, how='all')

     A     B    C
0  1.0  10.0  100
1  2.0   NaN  200
2  3.0   NaN  300
3  NaN   NaN  400

In [12]:
df.dropna(axis=1, thresh = 2)

     A    C
0  1.0  100
1  2.0  200
2  3.0  300
3  NaN  400

In [13]:
df.fillna("FILL")

      A     B    C     D
0   1.0  10.0  100  FILL
1   2.0  FILL  200  FILL
2   3.0  FILL  300  FILL
3  FILL  FILL  400  FILL

In [14]:
df.fillna(df.mean())

     A     B    C   D
0  1.0  10.0  100 NaN
1  2.0  10.0  200 NaN
2  3.0  10.0  300 NaN
3  2.0  10.0  400 NaN

# Grouping

In [15]:
d = {
    'Company':['FB', 'GOOGLE', 'MICROSOFT', 'GOOGLE', 'FB', 'FB'],
    'Employee':['A', 'B', 'C', 'D', 'E', 'F'],
    'Sales':[100, 200, 300, 400, 500, 600]
}

df = pd.DataFrame(d)

In [16]:
df

     Company Employee  Sales
0         FB        A    100
1     GOOGLE        B    200
2  MICROSOFT        C    300
3     GOOGLE        D    400
4         FB        E    500
5         FB        F    600

In [17]:
df['Sales'].max()

600

In [18]:
df['Sales'].min()

100

In [19]:
df['Sales'].mean()

350.0

In [20]:
df.describe()

            Sales
count    6.000000
mean   350.000000
std    187.082869
min    100.000000
25%    225.000000
50%    350.000000
75%    475.000000
max    600.000000

In [22]:
grouped_df = df.groupby('Company')

In [23]:
grouped_df.mean()

           Sales
Company
FB         400.0
GOOGLE     300.0
MICROSOFT  300.0

In [24]:
grouped_df.max()

          Employee  Sales
Company
FB               F    600
GOOGLE           D    400
MICROSOFT        C    300

In [25]:
grouped_df.describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
FB          3.0  400.0  264.575131  100.0  300.0  500.0  550.0  600.0
GOOGLE      2.0  300.0  141.421356  200.0  250.0  300.0  350.0  400.0
MICROSOFT   1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

In [26]:
df['Company'].unique()

array(['FB', 'GOOGLE', 'MICROSOFT'], dtype=object)

In [27]:
df['Company'].nunique()

3

# Custom Functions

In [28]:
df

     Company Employee  Sales
0         FB        A    100
1     GOOGLE        B    200
2  MICROSOFT        C    300
3     GOOGLE        D    400
4         FB        E    500
5         FB        F    600

In [29]:
def give_bonus(sales):
    return sales + 100

In [30]:
df['Sales'].apply(give_bonus)

0    200
1    300
2    400
3    500
4    600
5    700
Name: Sales, dtype: int64

In [32]:
df['New Sales'] = df['Sales'].apply(lambda sales : sales + 100)

In [33]:
df

     Company Employee  Sales  New Sales
0         FB        A    100        200
1     GOOGLE        B    200        300
2  MICROSOFT        C    300        400
3     GOOGLE        D    400        500
4         FB        E    500        600
5         FB        F    600        700